# デタリキZX character list
chara_list = {
    1: '赤城 陽菜', # 0_0
    2: 'ユリアナ・フランドール', # 0_0
    3: '岸 瑛里', #4_0
    4: '田中 小雪', # 2_0
    5: '青井 七海', # 2_0
    6: '白咲 美月', # 0_0
    7: '透海 セイナ', # 0_0
    8: '東雲 和果', # 2_0
    9: '桃谷 小夜', # 2_0
    10: '緑川 美香', # 0_0
    11: '桜月 千影', # 2_1
    12: '日野原 すもも', # 2_1
    13: '黒木 風香', # 4_0
    14: '城戸 アイ', # 4_0
    15: '坂下 カエデ', # 0_0
    16: '戸田 ルイ', # 1_0
    17: '鈴見 知恵', # 2_0
    18: '藤宮 リリー', # 0_0
    19: 'ミーシャ・ワイル', # 2_0
    20: '高岡 ルカ', # 4_0
    21: '未来 希', # 4_0
    22: '睦峰 美蘭', # 2_1
    23: '池澤 ミオ', # 2_0
    24: 'エミット', # 4_0
    25: '', # 2_0
    26: 'レイン', # 4_0
    27: '', # 4_0
    28: 'ラファム', # 2_0
    29: 'レイヴェル', # 0_0
    30: '薊 優花', # 1_0
    31: '三枝 美咲', # 2_0
    32: '樫村 奈緒', # 2_0
    33: '菊田 蒼葉', # 4_0
    34: '菊田 小梅', # 4_0
    35: '杉浦 咲良', # 0_0
    36: '柴田 エレナ', # 2_0
    37: 'シェリル・セマート', # 0_0
    51: '風華 絹', # 2_0
    52: '水野 美兎', # 2_0
    53: '月坂 霧菜', # 1_0
    54: '陽川 真凛', # 0_0
    70: 'リグラス', # 1_1
    80: '比和 せき', # 1_0
    81: '尾野 ゆきな', # 2_0
    82: '柚原 ぼたん', # 2_0
    83: '八重石 芳佳', # 2_0
    84: '信楽 いのり', # 5_0
    85: '鈴代 心愛', # 2_0
    86: '清宮 れな', # 2_0
    87: '大能 みおな', # 0_0
    88: '笹倉 ゆず', # 2_0
    89: 'ステラ リベリ', # 2_0
    90: '岐津 まつば', # 0_0
    91: '本城 怜里', # 5_0
    92: '柳 夕花', # 1_0

    # 恋姫†夢想
    100: '関羽［愛紗］', # 2_0
    101: '劉備［桃香］', # 0_0
    102: '諸葛亮［朱里］', # 4_0
    103: '趙雲［星］', # 0_0
    104: '孫権［蓮華］', # 2_0
    105: '鳳統［雛里］', # 4_0
    106: '呂布［恋］', # 0_0
    107: '馬超［翠］', # 0_0

    # 天衣創聖ストライクガールズ
    140: 'セフィーナ・クウォーツ', # 0_0

    200: '酒井 芽衣菜', # 2_0
    201: '島谷 果歩', # 2_0
    202: '浜村 リカ', # 4_0
    203: '磯部 香織里', # 6_0
    204: '多賀部 紬', # 2_0
    205: '早田 檸檬', # 1_0
    206: '武藤 凛花', # 6_0
    207: '切干 美海', # 2_1
    208: '雪駄 恵茉', # 2_0
    209: '霜田 霞', # 0_0
    210: 'ムーリン', # 4_0
    211: 'ママーリキッド', # 0_0
    212: 'ルルーパウダー', # 2_1
    213: 'ララーソリッド', # 4_0
    214: 'ミミーバンド', # 2_0
    215: 'クルセイド・ゼラフィム', # 2_0
    216: 'ジャスミン', # 2_0
    217: 'イヴ・ネモフィラ', # 2_0
    218: 'ビオラ', # 6_0
    219: 'ブレイン', # 6_0
    220: 'フリージア', # 2_0
    221: 'ユキノ・オハラ', # 0_0
    222: 'カラー', # 8_1
    223: 'ルスク', # 2_1
    225: '志須田 マリア', # 8_1
    226: '赤城 紗菜', # 2_0
    227: '賽乃木 イチゴ', # 4_0
    228: '妃王寺 園乃', # 7_1
    229: '琴塚 シイネ', # 7_1
    250: '七海', # 4_0
    251: '風香', # 1_0
    252: 'アイ', # 2_0
    253: '美兎', # 4_0
    254: 'セイナ', # 4_0
    255: '美海', # 4_0
    256: 'イヴ', # 4_0

    # ようこそ！恋ヶ崎女学園へ
    270: '幕ノ内 桜子', # 0_0
    271: '氷室 静乃', # 2_0
    272: 'ナナ', # 0_0

    # 神殺しのアリア
    280: '久遠寺 真稀', # 2_1
    281: '奈須原 みなみ', # 0_1
    282: 'クリスティーナ・ロッカ', # 0_1
    283: 'きらり・アンダーソン', # 7_1
    284: '桐生 絶佳', # 2_1
    285: 'エリー・メイザース', # 0_1
    286: '雨傘 雫', # 2_1
    287: 'エクレシア', # 2_1

    # アートワール 魔法学園の乙女たち
    290: 'セレス', # 2_0
    291: 'サクラ', # 2_0
    292: 'ルナ', # 0_0

    # エンジェリックリンク
    300: 'ルシフェル', # 2_0
    301: 'ベリアル', # 4_0
    302: 'ベルゼブブ', # 7_1
    303: 'バフォメット', # 2_0
    304: 'サタン', # 4_0
    305: 'アスタロト', # 7_1

    # Piaキャロットへようこそ!!3
    310: '高井 さやか', # 0_0
    311: '羽瀬川 朱美', # 0_0
    312: '岩倉 夏姫', # 2_0
    313: '愛沢 ともみ', # 5_0
    314: '木ノ下 貴子', # 2_0
    315: '君島 ナナ', # 1_0

    # 魔王の始め方
    320: 'リル', # 7_1
    321: 'ユニス', # 1_0
    322: 'スピナ', # 0_0
    323: 'エレン', # 2_0

    # 天啓パラドクス(3Dフェス)
    330: 'ソフィア', # 0_0
    331: 'ライサ', # 9_0

    # 宝石姫 Reincarnation(3Dフェス)
    340: 'リア・ファル', # 2_0
    341: 'フィーア', # 2_1

    # シャングリラドライブ
    350: 'ナァミル', # 9_0
    351: 'コハル', # 0_0
    352: 'ブレンダ', # 7_1
    353: 'メイメイ', # 2_0
    354: 'セツ', # 9_0
    355: 'エルトリンデ', # 7_1

    # ぺロペロサイミン
    360: 'リル・リリス', # 2_0
    361: '白雪 愛瑠', # 8_1
    362: '岡嶋 亞梨栖', # 1_0
    363: '牛蜜 みるく', # 7_1

    # バーチャコール3
    370: 'プリシア', # 2_0
    371: 'ウィンディ', # 2_0
    372: '有栖川 光海', # 0_0
    373: '神楽坂 ちさと', # 2_0

    # アイ・アム・マジカミ
    380: '遊部 いろは', # 0_0
    381: '百波瀬 ここあ', # 2_0
    382: '東山 陽彩', # 9_0
    383: '大鳥 丹', # 2_0

    # Canvas
    390: '橘 天音', # 1_0
    391: '桜塚 恋', # 2_0
    392: '鳳仙 エリス', # 2_0
    393: '桔梗 霧', # 0_0

    # 嫌な顔されながらおパンツ見せてもらいたい	
    400: '伊東 ちとせ', # 2_0
    401: '瀬賀 あいり', # 0_0
    402: '', # 2_0
    403: '', # 0_0

    500: 'ルキア', # 4_0
}